readme updated architecture
